/* Необхідно написати програму, яка виконує складання чисел від N до M (N та M – задаються користувачем), 
а також програма має вміти пропускати парні числа. Нижче приведено алгоритм, що потрібно зробити.

(!) При виводі суми можна використовувати функції console.log или document.writeln

Отримайте у користувача число(N) від якого ми будемо складати. Отримати число можна за допомогою prompt. 
Пам'ятайте, ЧИСЛО, не РЯДОК!
Перевірте, чи є передане значення N ЦІЛИМ числом. 
(Підказка: якщо при конвертації в ціле число ми отримали NaN – це число нам не підходить)
Отримайте у користувача число(M) до якого ми будемо складати (включно). 
Отримати число можна за допомогою prompt. Пам'ятайте, ЧИСЛО, не РЯДОК!
Перевірте, чи є передане значення M ЦІЛИМ числом.
 (Підказка: якщо при конвертації в ціе число ми отримали NaN – це число нам не підходит)
Отримайте у користувача булевий параметр(true/false), 
який підкаже нам чи потрібно пропускати парні числа. TRUE – потрібно, 
FALSE – не потрібно. Використовуйте функцію confirm
Напишіть цикл, який буде складати числа від раніше отриманих N и M
В циклі додайте перевірку – чи потрібно пропускати при складанні парні числа. 
(Використовуйте для цього if/else). Якщо парні числа потрібно пропускати не додавайте їх до суми.
Виведіть результат
Приклад: користувач ввів такі значення для N=10, M=100, ПропускатиПарні=TRUE – сума чисел виведена на екрані буде === 2475
Приклад: користувач ввів такі значення для N=10, M=100, ПропускатиПарні=FALSE – сума чисел виведена на екрані буде === 5005
Приклад: користувач ввів такі значення для N=1, M=10, ПропускатиПарні=FALSE – сума чисел виведена на екрані буде === 55 */


document.addEventListener('DOMContentLoaded', () => {
  let number1;
  let number2;
  let skipEvenNum;
  do {
    number1 = prompt('Enter first integer number');
  } while (!Number.isInteger(Number(number1)) || number1 == null);
  do {
    number2 = prompt('Enter second integer number');
  } while (!Number.isInteger(Number(number2)) || number2 == null);
  skipEvenNum = confirm('Do you want to skip even numbers?');
  calcSum(number1, number2);
  function calcSum(number1, number2) {
    if (number1 > number2) {
      let number3 = number1;
      number1 = number2;
      number2 = number3;
    }
    let sum = 0;
    number1 = +number1;
    number2 = +number2;
    for (let i = number1; i <= number2; i++) {
      let isEven = !(i % 2);
      if (skipEvenNum && isEven) {
        continue;
      } else {
        sum += i;
      }
    }
    document.writeln(sum);
  };
});